In [6]:
import pandas as pd

In [ ]:
data1={'Id':[1,2,3,4],'Name':['Zahid','Ubaid','Arbab','Adil']}
data2={'Id':[1,2,3,4],'City':['Abbottabad','Islamabad','pindi','lahore']}
data1=pd.DataFrame(data1)
data2=pd.DataFrame(data2)

Merging data on id

In [11]:
merge_data=pd.merge(data1,data2,on='Id',how='inner')
merge_data

   Id   Name        City
0   1  Zahid  Abbottabad
1   2  Ubaid   Islamabad
2   3  Arbab       pindi
3   4   Adil      lahore

concatenate data

In [ ]:
#Concatenation in rows
concat_data=pd.concat([data1,data2],axis=0)
concat_data

   Id   Name        City
0   1  Zahid         NaN
1   2  Ubaid         NaN
2   3  Arbab         NaN
3   4   Adil         NaN
0   1    NaN  Abbottabad
1   2    NaN   Islamabad
2   3    NaN       pindi
3   4    NaN      lahore

In [15]:
#Concatenation in columns
concat_data=pd.concat([data1,data2],axis=1)
concat_data

   Id   Name  Id        City
0   1  Zahid   1  Abbottabad
1   2  Ubaid   2   Islamabad
2   3  Arbab   3       pindi
3   4   Adil   4      lahore